<?php
// Заголовок
$_['heading_title']          = 'Список статей';

// Текст
$_['text_success']           = 'Успіх: Ви змінили список статей!';
$_['text_list']              = 'Список статей';
$_['text_add']               = 'Додати статтю';
$_['text_edit']              = 'Редагувати статтю';
$_['text_extension']         = 'Розширення';
$_['text_blog']              = 'Блог';

// Колонка
$_['column_name']            = 'Назва статті';
$_['column_status']          = 'Статус';
$_['column_action']          = 'Дія';

// Поле
$_['entry_name']             = 'Назва списку статей';
$_['entry_article_list']     = 'Статті';
$_['entry_status']           = 'Статус';

// Підказка
$_['help_category']          = '(Автозаповнення)';

// Помилка
$_['error_warning']          = 'Увага: Будь ласка, уважно перевірте форму на помилки!';
$_['error_permission']       = 'Увага: У вас немає дозволу на зміну статей!';
$_['error_name']             = 'Назва статті повинна містити від 3 до 255 символів!';
$_['error_meta_title']       = 'Мета заголовок повинен містити від 3 до 255 символів!';
$_['error_keyword']          = 'SEO ключове слово вже використовується!';


