<?php
// Заголовок
$_['heading_title']   	  = 'Пакети зі знижками';

// Текст
$_['text_module']      		= 'Модулі';
$_['text_success']     		= 'Успішно: Ви змінили модуль зі знижками Pack!';
$_['text_edit']       		= 'Редагувати модуль зі знижками Pack';
$_['text_edit_discounts'] = 'Редагувати пакети зі знижками';
$_['text_category']			  = 'Категорія';
$_['text_customer']			  = 'Клієнт';
$_['text_customer_name'] 	= 'Ім\'я клієнта';
$_['text_add_customer'] 	= 'Додати нову знижку для клієнта';
$_['text_customer_group'] = 'По группі клієнтів';
$_['text_manufacturer']		= 'По брендам';
$_['text_volume']			    = 'По обєму';
$_['text_ordertotal']		  = 'По суммі замовлення';
$_['text_loyalty']			  = 'Програма лояльність';
$_['text_product']			  = 'По товарам';
$_['text_upgrade']			  = 'Оновлення бази даних для v1.3.0';

// Кнопка
$_['button_save_stay']	  = 'Зберегти і залишитися';

// Поле введення
$_['entry_status']     				= 'Статус';
$_['entry_include_specials']     	= 'Включити в акційні пропозиції';
$_['entry_override_special_price'] 	= 'Поведінка спеціальної ціни продукту';
$_['entry_override_discount_price'] = 'Поведінка ціни зі знижкою на продукт';
$_['entry_sort_order'] 				= 'Порядок сортування загального замовлення';
$_['entry_rounding'] 				= 'Режим округлення';
$_['entry_rounding_precision'] 		= 'Точність округлення';

// Довідка
$_['help_override_special_price']  	= '<b>За замовчуванням:</b> Знижка застосовуватиметься до спеціальної ціни, якщо на продукт налаштована спеціальна ціна продукту.<br /><b>Ексклюзивно:</b> Знижка не буде застосовуватися до продуктів з налаштованою спеціальною ціною продукту. (Спеціальна ціна продукту має пріоритет)<br /><b>Перезапис:</b> Налаштована знижка перезапише налаштовану спеціальну ціну продукту.';
$_['help_override_discount_price'] 	= '<b>За замовчуванням:</b> Знижка застосовуватиметься до ціни продукту зі знижкою, якщо для продукту налаштована ціна продукту зі знижкою.<br /><b>Перезапис:</b> Налаштована знижка перезапише налаштовану ціну продукту зі знижкою.';
$_['help_rounding'] 				=  'Округлення виконується за допомогою функції <b>round</b> PHP. <br /><b>Угору</b>: Значення округлюється вгору до десятичних знаків від нуля, коли воно на півшляху туди.<br/><small>1.5 стає 2, а -1.5';
