<?php
// Heading
$_['heading_title'] = 'OC Redirect';
$_['heading_add']   = 'Redirect manager - додати правило';
$_['heading_edit']  = 'Redirect manager - редагувати правило';

//Text
$_['text_enabled']                    = 'Enable';
$_['text_disabled']                   = 'Disable';
$_['text_remove_redirect']            = 'Видалити';
$_['text_export']                     = 'Експорт';
$_['text_import']                     = 'Імпорт';
$_['text_import_file']                = 'Файл імпорту';
$_['text_import_delimiter']           = 'Роздільник';
$_['text_import_delimiter_tab']       = 'Tab';
$_['text_import_delimiter_coma']      = 'Кома';
$_['text_import_delimiter_semicolon'] = 'Крапка з комою';
$_['text_success_update']             = 'Дані оновлено';
$_['text_success_save']               = 'Правило успішно додано';
$_['text_success_remove']             = 'Правило успішно видалено';
$_['text_return_to_main']             = 'Повернутися до списку правил';
$_['text_result_all']                 = 'записи';
$_['text_result_update']              = 'Оновлено записів';
$_['text_result_insert']              = 'Додано записів';
$_['text_result_remove']              = 'Видалено записів';
$_['text_result_error']               = 'Помилкових записів';
$_['text_remove_redirect_text']       = 'Ви хочете видалити правило?';
$_['text_clear_list']                 = 'Ви хочете очистити всю таблицю правил??';
$_['text_sure']                       = 'Ви впевнені?';
$_['text_module']                     = 'Модулі';
$_['text_result_check']               = 'Результат перевірки відповіді';
$_['text_success_result_all']         = 'Всього опрацьовано:';
$_['text_success_result_insert']      = 'Всього додано:';
$_['text_success_result_update']      = 'Всього обоновленно:';
$_['text_success_result_remove']      = 'Всього видалено:';
$_['text_success_result_error']       = 'Всього помилок:';

// Tab
$_['tab_list']     = 'Список правил';
$_['tab_settings'] = 'Налаштування';
$_['tab_help']     = 'Help / Support';

// Entry
$_['entry_from_url']         = 'Джерело (звідки)';
$_['entry_to_url']           = 'Приймач (куди)';
$_['entry_code']             = 'HTTP відповідь сервера';
$_['entry_status']           = 'Статус';
$_['entry_templates']        = 'Альтрнативний Шаблон для 404 сторінки';
$_['entry_import_file']      = 'Файл імпорту';
$_['entry_import_delimiter'] = 'Роздільник';
$_['entry_change']           = 'Додавати 301 при редагуванні в url';
$_['entry_delete']           = 'Додавати 410 при видаленні';

$_['column_from_url']  = 'Джерело';
$_['column_to_url']    = 'Куди';
$_['column_code']      = 'HTTP відповідь';
$_['column_status']    = 'Статус';
$_['column_action']    = 'Дії';
$_['column_qnt']       = 'Кількість спрацьовувань';
$_['column_last_date'] = 'Останній раз';

// buttons
$_['button_close']  = 'Закрити';
$_['button_filter'] = 'Фільтр';
$_['button_check']  = 'Перевірити правило';

// codes
$_['codes'][301] = 'Постійне перенаправлення';
$_['codes'][302] = 'Тимчасове пренаправление';
$_['codes'][410] = 'Видалено назавжди (GONE)';


// errors 
$_['error_from_url']          = 'Джерело (звідки) вказано не вірно';
$_['error_protocol_from_url'] = '\'From url\' поле не може містити http(s)://';
$_['error_to_url']            = 'Приймач (куди) вказано не вірно';
$_['error_code']              = '\'HTTP відповідь сервера\' вказаний невірно';
$_['error_enabled']           = '\'Статус\' вказаний невірно';
$_['error_uploadfile']        = 'Файл не завантажений';
$_['error_data']              = 'Некоректні дані в рядку %s';

//help
$_['help_to_url']   = 'Ви можете вказати адресу зовнішнього сайту';
$_['help_from_url'] = 'Вказуйте адресу http(s) протоколу та без імені(назви) сайту';
$_['help_text']     = '
<p>Модуль додає в OpenCart функціонал редиректів зі сторінок сайту на внутрішні.</p>
<h3>Де може використовуватися</h3>
<p>Якщо ви створюєте нову структуру сайту або переносите сайт з іншого движка (CMS), 
цей модуль допоможе Вам безболісно створити списки редиректів з однієї сторінки на іншу. <br>
Так само можливі випадки коли на ваш сайт дали невірне посилання, написали з помилкою, то ви можете 
перенаправляти відвідувачів на вірну сторінку.
</p>
<p>Модуль підтримує наступні HTTP-коди сервера:</p>
<ol>
   <li>301 - Переміщено назавжди<br>
 Рекомендований код для сторінок, які потрібно пренаправить і ви точно впевнені що такої сторінки немає і не буде.
 </li>
   <li>302 - Переміщено тимчасово<br>
 Код сторінок, які, можливо, тимчасово отстуствуют, наприклад сторінка товару, який раніше був і, можливо, з\'явиться в майбутньому.
 </li>
   <li>410 - Сторінка не знайдена (Gone)<br>
 Цей код призначений для "Сильного" видалення. Прийнято вважати, що ПС сама розбереться зі сторінками NOT FOUND, але як 
 показує практика сторінки з кодо 404 залишаються довго в індексі. а 410 допомагає швидше їх звідти викинути.
 </li>
   <li>404 - Сторінка не знайдена. Цей код залишений на майбутнє.</li>
   <li>403 - Доступ заборонений. Дуже часто ваш сайт перевіряють різними скриптами, за відомими адресами.
 Такі заходи отримують в основному 404 помилку, Але при цьому створюється невелика, але навантаження. Для запобігання такої ситуації і 
 застосовується такий код відповіді.
 </li>
</ol>

<p>Модуль володіє можливістю використовувати регулярні вирази в правилах редіректу</p>
<p>Наприклад:</p>
<table class="table-bordered table-striped table-condensed">
	<tr>
		<th>Правило для<br>старого url</th>
		<th>Коментар</tр>
		<th>Приклад</th>
	</tr>
	<tr>
		<td>old-url/?</td>
		<td>не має значення, присутній слеш в кінці URL чи ні.</td>
		<td>catalog/ =&gt; new-url<br>
 catalog =&gt; new-url
 </td>
	</tr>
	<tr>
		<td>old-url/[a-zA-Z]+/?</td>
		<td>будь-яке слово, що містить латинські літери, як малі, так і великі</td>
		<td>category/aBcDe/ =&gt; new-url<br>
 category/aBcDefght =&gt; new-url
 </td>
	</tr>
	<tr>
		<td>old-url/(1/2|x)/?</td>
		<td>слово між дужками може містити числа 1, 2 або символ x</td>
		<td>item/1/<br>
 item/2/<br>
 item/x<br>	
		</td>
	</tr>
	<tr>
		<td>old-url/.{1,5}/?</td>
		<td>будь-які символи у кількості від одного до п\'яти</td>
		<td>product/234/<br>
 product/xyzwe<br>
		</td>
	</tr>
	<tr>
		<td>old-url/.{5}/?</td>
		<td>будь-яке слово, яке складається з 5 символів </td>
		<td>some-url/abcde/<br>
 some-url/12345<br></td>
	</tr>
</table>

';
