<?php

// Heading
$_['heading_title'] = 'Массовое управления комплектами';

$_['text_module'] = 'Модули';
$_['text_success'] = 'Настройки успешно изменены!';
$_['text_edit'] = 'Настройки модуля';
$_['text_info'] = 'Тут со временем появятся настройки';
$_['text_before'] = 'Перед';
$_['text_after'] = 'После';



$_['entry_success'] = 'Выполнено';
$_['entry_category'] = 'Выберите категорию';
$_['entry_products'] = 'Выберите товары';

$_['entry_name'] = 'Наименование';
$_['entry_discount'] = 'Скидка';
$_['entry_qunatity'] = 'Кол-во';
$_['entry_option'] = 'Опции';
$_['entry_delete'] = 'Удалить';
$_['btn_add_set'] = 'Добавить комплект к существующим<br>в товарах категории';
$_['btn_del_set'] = 'Очистить товары с категории от комплектов';

$_['entry_save'] = 'Успешно сохранено';

// Error
$_['error_permission'] = 'У Вас нет прав для изменения модуля Комплекты!';
$_['error_empty_products'] = 'Добавьте хотя бы 1 продукт и выберите категорию!';
$_['error_empty_category'] = 'Выберите категорию!';

