<?php

// Heading
$_['heading_title']  = 'Вхід в акаунт';

// Text
$_['text_account']                 = 'Мій кабінет';
$_['text_login']                   = 'Логін';
$_['text_new_customer']            = 'Новий клієнт';
$_['text_register']                = 'Реєстрація';
$_['text_register_account']        = 'Створивши обліковий запис, ви зможете швидше робити покупки, бути в курсі статусу замовлення та відстежувати замовлення, які ви зробили раніше.';
$_['text_returning_customer']      = 'Клієнт, що повертається';
$_['text_i_am_returning_customer'] = 'Я постійний клієнт';
$_['text_forgotten']               = 'Забули пароль';
$_['button_register_link']         = 'Реєстрація';
$_['success_message']              = 'Вітаю! Реєстрація успішна';
$_['text_title_user']              = 'Вітаю! %s';
$_['text_logout']                  = 'Вийти';

// Entry
$_['entry_email']                  = 'E-Mail';
$_['entry_password']               = 'Пароль';

// Error
$_['error_email']                  = 'Адреса електронної пошти недійсна!';
$_['error_password']               = 'Пароль має бути від 4 до 20 символів!';
$_['error_login']                  = 'Попередження: адреса електронної пошти та/або пароль не відповідають.';
$_['error_attempts']               = 'Попередження: у вашому обліковому записі перевищено дозволену кількість спроб входу. Повторіть спробу через 1 годину.';
$_['error_approved']               = 'Попередження: ваш обліковий запис вимагає схвалення, перш ніж ви зможете ввійти.';
