<?php
// Heading 

$_['text_colose'] = 'Закрити';
$_['newletter_des'] = 'Зареєструйтесь і будьте в курсі останніх новин та акцій';
//newletter-subscribe
$_['heading_title2'] = 'Знижка для зареестрованих користувачів';
$_['newletter_des2'] = 'Зареєструйтесь і будьте в курсі останніх новин та акцій';

//Fields
$_['entry_email'] = 'Введіть e-mail ...';
$_['entry_name'] = 'Ім\'я';

//Buttons
$_['entry_button'] = 'Підписатися';
$_['entry_unbutton'] = 'Відписатися';

//text
$_['text_subscribe'] = 'Підпишіться тут';
$_['mail_subject'] = 'Підписатися на розсилку';

//Messages
$_['error_invalid'] = 'Введіть дійсну електронну адресу.';
$_['error_polici'] = 'Будь ласка, підтвердіть, що ви погоджуєтесь з нашою Політикою конфіденційності та обробкою ваших даних.';
$_['subscribe'] = 'Успішно підписані.';
$_['unsubscribe'] = 'Підписку скасовано.';
$_['alreadyexist'] = 'Електронна адреса вже підписана.';
$_['notexist'] = 'Електронної пошти не існує.';
$_['entry_show_again'] = "Більше не показувати це спливаюче вікно";
