<?php

$_['heading_title_card']        = 'Інформація про мою картку';
$_['text_account']              = 'Особистий кабінет';
$_['info_card']                 = 'Дисконтна карта';

$_['text_phone']                = 'Телефон';
$_['text_code']                 = 'Код';
$_['text_sum']                  = 'Сума замовлень по карті';
$_['text_percent']              = 'Знижка';

$_['text_register_bot']         = 'Отримай дисконтну карту безпосередньо через чат-боти';
$_['text_generate_info']        = 'P.S. QR код генерується кожен день новий';
$_['text_after_generate_info']  = 'P.S. Дисконтна карта буде активована на наступний день після реєстрації в чат-боті';

