<?php
// Heading
$_['heading_title']    = 'Push повідомлення';

// Text
$_['text_success']     = 'Успіх: Ви відправили push повідомлення!';
$_['text_list']        = 'Відправка повідомлення';
$_['text_select_all']  = 'Виділити все';
$_['text_unselect_all'] = 'Зняти виділення';

// Entry
$_['entry_user']           = 'Користувач';
$_['entry_message']        = 'Повідомлення';

// Error
$_['error_permission'] = 'Увага: У вас немає прав для управління push повідомленнями!';
$_['error_message']    = 'Повідомлення повинно бути від 1 до 1000 символів!';
$_['error_user']       = 'Будь ласка, виберіть хоча б одного користувача!';
