<?php

// Text
$_['text_subject']        = '%s - Дякуємо за реєстрацію';
$_['text_welcome']        = 'Ласкаво просимо в магазин %s і дякуємо за реєстрацію!';
$_['text_login']          = 'Ваш обліковий запис створений і ви можете виконати вхід в особистий кабінет';
$_['text_approval']       = 'Ваш обліковий запис створений і чекає підтвердження. Після підтвердження, ви зможете виконати вхід в особистий кабінет';
$_['text_service']        = 'Після входу в особистий кабінет Ви зможете отримати доступ до різних сервісів магазину, таких як журнал замовлень, прайс-лист, редагування інформації вашого облікового запису (адрес доставки, телефону для зв’язку) та інше. Для постійних покупців у нас передбачені знижки.';
$_['text_thanks']         = 'Дякуємо,';
$_['text_new_customer']   = 'Новий покупець';
$_['text_signup']         = 'Зареєстрований новий покупець:';
$_['text_customer_group'] = 'Група покупців:';
$_['text_firstname']      = 'Ім’я:';
$_['text_lastname']       = 'Прізвище:';
$_['text_email']          = 'E-Mail:';
$_['text_telephone']      = 'Телефон:';
